wangnan31415926/nrf5-sdk-15.3.0/examples/ble_peripheral/ble_app_bma250E/main.c
static void application_timers_start(void)
{
    ret_code_t err_code;

//    // Start application timers.
//    err_code = app_timer_start(m_test_timer_id, APP_TIMER_TICKS(20), NULL);
//    APP_ERROR_CHECK(err_code);
	
	    // Start application timers.
    err_code = app_timer_start(m_lowpower_timer_id, APP_TIMER_TICKS(1000), NULL);
    APP_ERROR_CHECK(err_code);

}


void Bluetooth_ReciveANDSend(void * p_event_data, uint16_t event_size)
{
	    for (uint32_t i = 0; i < length; i++)
    {
        app_uart_put(uartbuf[i]);
    }
		length=0;
}

unsigned char con_stop_flag=0;//连接情况下定时器停止标志位
//低功定时查询函数,每1s进入累计一次
//到达超时限制，关闭广播，bma进入lowpower
void lowpower_timeout_handler(void * p_context)
	{
		 UNUSED_PARAMETER(p_context);

		 if(lowpower_timer_i<(lowpower_timerover_max*3))
		 {lowpower_timer_i++;}
		 else
		 {
			 
			 if(Adv_flag!=0)//没有关闭广播
			 {//低功耗处理
				 if(connect_flag==0)
         {
				  sd_ble_gap_adv_stop(m_advertising.adv_handle);
				  Adv_flag=0;//请标志位
				 }//关闭蓝牙广播
			 }

				if(con_stop_flag!=1)
					{
						app_timer_stop(m_test_timer_id); 
						con_stop_flag=1;
						bma250_i=0;
						bma250_j=0;
					}
				 
			 
			 
			 if(bma250Lwp_flag!=0)//传感器未进低功耗
			 {//低功耗处理
				 bma_lowpower();
			 }
			 
		 }
		 
		 //定时读取中断标志位
		 if(BMA250_interrupt_status())
		 {
		    lowpower_timer_i=0;
			 
				if(Adv_flag==0)//判断是否广播
				{    
				advertising_start();
				Adv_flag=1;//蓝牙广播标志位置1
				}//进行广播
				
  			if(bma250Lwp_flag==0)//判断bma250是否进入工作模式
				{bma_init();}//bma250进入工作模式
				
				if(con_stop_flag==1)
				{
					app_timer_start(m_test_timer_id, APP_TIMER_TICKS(20), NULL);
					con_stop_flag=0;
					num=0;
				}
		 }
			 
		
	}


void test_timeout_handler(void * p_context)
{
	static unsigned char i=0;
	static unsigned short j=0;

	 UNUSED_PARAMETER(p_context);

	 BMA253_Timer_Handler();
    
		uartbuf[0+bma250_i*6]=V_BMA255FIFOData_U8R[1];
		uartbuf[1+bma250_i*6]=V_BMA255FIFOData_U8R[0];

		uartbuf[2+bma250_i*6]=V_BMA255FIFOData_U8R[3];
		uartbuf[3+bma250_i*6]=V_BMA255FIFOData_U8R[2];

		uartbuf[4+bma250_i*6]=V_BMA255FIFOData_U8R[5];
		uartbuf[5+bma250_i*6]=V_BMA255FIFOData_U8R[4];
	  
	  if(bma250_j<40&&bma250_i<45)
	  {
			bma250_j=bma250_j+6;
	    bma250_i++;
		}

	if(connect_flag==1&&bma250_i>=3)
	{
	  uartbuf[0+bma250_i*6]=(unsigned char)(num>>8);
	  uartbuf[1+bma250_i*6]=(unsigned char)num;
		bma250_j=bma250_j+2;
	  ble_nus_data_send(&m_nus, uartbuf, &bma250_j, m_conn_handle);
    bma250_j=0;
    bma250_i=0;
    num++;		
	}
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
	
	    err_code = app_timer_create(&m_test_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                test_timeout_handler);
      APP_ERROR_CHECK(err_code);
	
		  err_code = app_timer_create(&m_lowpower_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                lowpower_timeout_handler);
      APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)//蓝牙接收到数据
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
//
			
				memcpy(uartbuf,&p_evt->params.rx_data.p_data[0],p_evt->params.rx_data.length);
	length=p_evt->params.rx_data.length;
	app_sched_event_put(NULL,NULL, Bluetooth_ReciveANDSend); 
//        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
//        {
//            do
//            {
//                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
//                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
//                {
//                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
//                    APP_ERROR_CHECK(err_code);
//                }
//            } while (err_code == NRF_ERROR_BUSY);
//        }
				//
        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
        {
            while (app_uart_put('\n') == NRF_ERROR_BUSY);
        }
    }

