wangnan31415926/nrf5-sdk-15.3.0/examples/ble_peripheral/ble_app_bma250E/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}





/**@brief Function for changing the tx power.
 */
static void tx_power_set(void)
{
    ret_code_t err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, m_advertising.adv_handle,8);
    APP_ERROR_CHECK(err_code);
}

nrfx_gpiote_evt_handler_t Button_handle(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
//	 printf("\r\nGPIOE.\r\n");
	 lowpower_timer_i=0;//清累计值

	 if(Adv_flag==0)//判断是否广播
	 {    
		 advertising_start();
		 Adv_flag=1;//蓝牙广播标志位置1
	 }//进行广播
		
	  if(bma250Lwp_flag==0)//判断bma250是否进入工作模式
	  {bma_init();}//bma250进入工作模式
}

//GPIOTE 中断初始化
void GPIOTE_init(void)
{
    ret_code_t err_code;    
  
    err_code=nrf_drv_gpiote_init();//GPIOTE初始化
    APP_ERROR_CHECK(err_code);
    
    
    //输入中断配置
    nrf_drv_gpiote_in_config_t button_config=GPIOTE_CONFIG_IN_SENSE_LOTOHI(true);//上升沿触发
    button_config.pull=NRF_GPIO_PIN_PULLUP;  //
    err_code=nrf_drv_gpiote_in_init(BUTTON_0,&button_config,Button_handle);
    APP_ERROR_CHECK(err_code);
    nrf_drv_gpiote_in_event_enable(BUTTON_0,true);
}


//******************************************wdt******************************//
nrf_drv_wdt_channel_id m_channel_id;
/**
 * @brief WDT events handler.
 */
void wdt_event_handler(void)
{
    
 
    //NOTE: The max amount of time we can spend in WDT interrupt is two cycles of 32768[Hz] clock - after that, reset occurs
}

void WDT_Init(void)
{
	uint32_t err_code = NRF_SUCCESS;
	    //Configure WDT.
    nrf_drv_wdt_config_t config = NRF_DRV_WDT_DEAFULT_CONFIG;
    err_code = nrf_drv_wdt_init(&config, wdt_event_handler);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_wdt_channel_alloc(&m_channel_id);
    APP_ERROR_CHECK(err_code);
    nrf_drv_wdt_enable();
}
//******************************************wdt end******************************//
/**@brief Application main function.
 */
extern void SCL_(void);
int main(void)
{
    bool erase_bonds;
    // Initialize.
   
	 //GPIOTE中断
//	 GPIOTE_init();
	 //GPIOTE中断 end
	
	
//    uart_init();
//    log_init();
    timers_init();
//    buttons_leds_init(&erase_bonds);
		APP_SCHED_INIT(50,30);  //wn
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
//    printf("\r\nUART started.\r\n");
//    NRF_LOG_INFO("Debug logging for UART over RTT started.");
	  tx_power_set();
    advertising_start();
		Adv_flag=1;//蓝牙广播标志位置1
//	

    bma_init();
    application_timers_start();
    // Enter main loop.
    for (;;)
    {
			  app_sched_execute();
        idle_state_handle();
    }
}


/**
 * @}
 */
